[	// A is the player perspective during the tutorial. Represented as an apprentice.
	// B is the Tutorial's Doctor NPC.
	{"A": "Sorry, sir. My attention wandered."},
	{"B": "It is a good thing I am the doctor and you the apprentice or this plague would surely doom us all..."}
	{"B": "I asked how you would have treated this patient, had they come to us still alive.,"},
	// Scene shifts to diagnosis/treatment but the dialogue continues.
	{"A": "I do not know."},
	{"B": "Good. Admitting what you do not know is important for your learning. Look more closely at the throat and tell me what you see..."},
	// Scene is now less restricted with only certain options locked to the player. They can now examine the wounds on the throat and make a diagnosis.
	{"A": "This person suffocated from the swollen buboe blocking their air."}
	{"A": "I could have lanced and drained the buboe, then applied a poultice of comfrey and oakmoss to prevent further inflammation."},
	{"B": "Excellent. Show me how."},
	// Scene switches to brewing and crafting tutorial. Player is guided through crafting medicine by what is available or locked as an option during the process. Clicking on what they can advances the scene to the crafting-tutorial end.
	// Scene back to room with Doctor NPC. 
	{"B": "Exactly so. Keep that medicine for later, it would be wasted on this corpse."}
	{"B": "I am leaving my knowledge in good hands. I fear that despite my efforts to find a cure for this plague, I will soon be out of time."}
	{"B": "I feel the roots inside me twisting my organs and squeezing my heart."}
	{"B": "It is your job now. Continue my research. Find a cure for the plague. Be the salvation of the land... even if only to save yourself."},
	// Scene transitions somehow to the next day. The doctor is dead and discovered by the player. The apprentice becomes the new doctor.
	// Player is given popup option to examine the now dead doctor's body (review examination mechanics), or to dispose of the corpse along with the others, advancing the game to the map screen and beginning the core game loop outside of the tutorial.'
	// Map selection -> (potential random event) -> New town location. Peasants approach cart to trade or ask for help in window scene -> Examine accepted patients or go shopping -> Travel. REPEAT until game win or lose.
	{
		"BranchStart": 
		[
			{ 
				"ChoiceA":
					[
						"Examine the doctor's body (Examination Recap)",
						{"B": "Examine the doctor's body (Examination Recap)"},
						{"A": "(repeat examination tutorial)"},,
						{"EOD": "EOD"}						
					]
					
			},			

		
			{	
				"ChoiceB": 
				[
					"Dispose of the corpse, along with the others, and move on.",
					{"B": "Dispose of the corpse, along with the others, and move on."},
					{"A": "(moves to map scene for travel selection; continues the game)"},
					{"EOD": "EOD"}					
				]
			}

		
		]
	}
]

